Documents/АР_ЗаявкаНаОбслуживание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>АР_ЗаявкаНаОбслуживание</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.АР_ЗаявкиНаОбслуживание</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ЭлементыОбъектовАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АР_СтатусыЗаявокНаОбслуживание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполненияРабот</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КомплексРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КомплексРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/АР_ПараметрыЭксплуатацииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>АР_ПараметрыЭксплуатацииОбъектов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпецификацииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТехнологическаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ТехнологическиеКартыТехОбслуживания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипОбслуживания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АР_ТипыОбслуживанияОбъектовАренды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикОбслуживания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ГрафикиОбслуживания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказательВыработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ПоказателиВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПороговоеЗначениеВыработки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭлементОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ЭлементыОбъектовАренды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КомплексРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/АР_ТехнологическиеКартыТехОбслуживания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>АР_ТехнологическиеКартыТехОбслуживания</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Маршрут</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Операция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_ТехнологическиеОперации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВыполнения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВнутренняяРабота</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СпецификацииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>СпецификацииНоменклатуры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсходныеКомплектующие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/АР_ЗаявкаНаОбслуживание/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура предназначена для автоматического заполнения списка работ по данным технологических карт
Процедура ЗаполнитьРаботы() Экспорт
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АР_ПараметрыЭксплуатацииОбъектовСрезПоследних.Организация,
	|	АР_ПараметрыЭксплуатацииОбъектовСрезПоследних.ОбъектАренды,
	|	АР_ПараметрыЭксплуатацииОбъектовСрезПоследних.ЭлементОбъекта,
	|	АР_ПараметрыЭксплуатацииОбъектовСрезПоследних.КомплексРабот,
	|	АР_ПараметрыЭксплуатацииОбъектовСрезПоследних.Спецификация,
	|	АР_ПараметрыЭксплуатацииОбъектовСрезПоследних.ТипОбслуживания,
	|	АР_ПараметрыЭксплуатацииОбъектовСрезПоследних.ГрафикОбслуживания,
	|	АР_ПараметрыЭксплуатацииОбъектовСрезПоследних.ПоказательВыработки,
	|	АР_ПараметрыЭксплуатацииОбъектовСрезПоследних.ПороговоеЗначениеВыработки,
	|	АР_ПараметрыЭксплуатацииОбъектовСрезПоследних.ТехнологическаяКарта,
	|	АР_ТехнологическиеКартыТехОбслуживанияМаршрут.Операция,
	|	АР_ТехнологическиеКартыТехОбслуживанияМаршрут.Количество,
	|	АР_ТехнологическиеКартыТехОбслуживанияМаршрут.Работа,
	|	АР_ТехнологическиеКартыТехОбслуживанияМаршрут.ВнутренняяРабота
	|ИЗ
	|	РегистрСведений.АР_ПараметрыЭксплуатацииОбъектов.СрезПоследних(&МоментВремени, Организация = &Организация И ОбъектАренды = &ОбъектАренды И ЭлементОбъекта = &ЭлементОбъекта) КАК АР_ПараметрыЭксплуатацииОбъектовСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АР_ТехнологическиеКартыТехОбслуживания.Маршрут КАК АР_ТехнологическиеКартыТехОбслуживанияМаршрут
	|		ПО АР_ПараметрыЭксплуатацииОбъектовСрезПоследних.ТехнологическаяКарта = АР_ТехнологическиеКартыТехОбслуживанияМаршрут.Ссылка";
	
	Запрос.УстановитьПараметр("МоментВремени",МоментВремени());
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("ОбъектАренды",ОбъектАренды);
	Запрос.УстановитьПараметр("ЭлементОбъекта",ЭлементОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//заполняем в однократном размере по каждому комплексу работ	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		//добавляем работу в табличную часть
		СтрокаТЧ = Работы.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ,Выборка);
	КонецЦикла;
	
КонецПроцедуры

// Процедура предназначена для автоматического заполнения списка работ по данным технологических карт
Процедура ЗаполнитьМатериалы() Экспорт
	
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ РАЗЛИЧНЫЕ
	 |	Материалы.Номенклатура,
	 |	Материалы.Количество,
	 |	Материалы.КомплексРабот,
	 |	Материалы.ГрафикОбслуживания,
	 |	Материалы.ОбъектАренды,
	 |	Материалы.ЭлементОбъекта
	 |ИЗ
	 |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	 |		СпецификацииНоменклатурыИсходныеКомплектующие.Номенклатура КАК Номенклатура,
	 |		СУММА(СпецификацииНоменклатурыИсходныеКомплектующие.Количество) КАК Количество,
	 |		ВложенныйЗапрос.КомплексРабот КАК КомплексРабот,
	 |		АР_ПараметрыЭксплуатацииОбъектовСрезПоследних.ГрафикОбслуживания КАК ГрафикОбслуживания,
	 |		ВложенныйЗапрос.ОбъектАренды КАК ОбъектАренды,
	 |		ВложенныйЗапрос.ЭлементОбъекта КАК ЭлементОбъекта
	 |	ИЗ
	 |		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	 |			АР_ЗаявкаНаОбслуживаниеРаботы.Ссылка.ОбъектАренды КАК ОбъектАренды,
	 |			АР_ЗаявкаНаОбслуживаниеРаботы.Ссылка.ЭлементОбъекта КАК ЭлементОбъекта,
	 |			АР_ЗаявкаНаОбслуживаниеРаботы.КомплексРабот КАК КомплексРабот
	 |		ИЗ
	 |			Документ.АР_ЗаявкаНаОбслуживание.Работы КАК АР_ЗаявкаНаОбслуживаниеРаботы
	 |		ГДЕ
	 |			АР_ЗаявкаНаОбслуживаниеРаботы.Ссылка = &Ссылка) КАК ВложенныйЗапрос
	 |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_ПараметрыЭксплуатацииОбъектов.СрезПоследних(&МоментВремени, Организация = &Организация) КАК АР_ПараметрыЭксплуатацииОбъектовСрезПоследних
	 |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СпецификацииНоменклатуры.ИсходныеКомплектующие КАК СпецификацииНоменклатурыИсходныеКомплектующие
	 |				ПО АР_ПараметрыЭксплуатацииОбъектовСрезПоследних.Спецификация = СпецификацииНоменклатурыИсходныеКомплектующие.Ссылка
	 |			ПО ВложенныйЗапрос.ОбъектАренды = АР_ПараметрыЭксплуатацииОбъектовСрезПоследних.ОбъектАренды
	 |				И ВложенныйЗапрос.ЭлементОбъекта = АР_ПараметрыЭксплуатацииОбъектовСрезПоследних.ЭлементОбъекта
	 |				И ВложенныйЗапрос.КомплексРабот = АР_ПараметрыЭксплуатацииОбъектовСрезПоследних.КомплексРабот
	 |	
	 |	СГРУППИРОВАТЬ ПО
	 |		ВложенныйЗапрос.КомплексРабот,
	 |		СпецификацииНоменклатурыИсходныеКомплектующие.Номенклатура,
	 |		АР_ПараметрыЭксплуатацииОбъектовСрезПоследних.ГрафикОбслуживания,
	 |		ВложенныйЗапрос.ОбъектАренды,
	 |		ВложенныйЗапрос.ЭлементОбъекта) КАК Материалы";
	 
 	Запрос.УстановитьПараметр("МоментВремени",МоментВремени());
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("ПлановыеЦены",Справочники.ТипыЦенНоменклатуры.НайтиПоНаименованию("Основной"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//теперь пройдемся по всем объектам и их элементам	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		//добавляем работу в табличную часть
		СтрокаТЧ = Материалы.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ,Выборка);
	КонецЦикла;
  	
КонецПроцедуры

Процедура ПроверитьПринадлежностьЭлементаОбъекту(Отказ)
	
	// Проверим принадлежит ли элемент данному объекту
	Если ЗначениеЗаполнено(ОбъектАренды) И ЗначениеЗаполнено(ЭлементОбъекта) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", ОбъектАренды);
		Запрос.УстановитьПараметр("Элемент", ЭлементОбъекта);
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АР_ОбъектыАрендыЭлементы.Ссылка
		|ИЗ
		|	Справочник.АР_ОбъектыАренды.Элементы КАК АР_ОбъектыАрендыЭлементы
		|ГДЕ
		|	АР_ОбъектыАрендыЭлементы.Ссылка = &Ссылка
		|	И АР_ОбъектыАрендыЭлементы.Элемент = &Элемент";
		Если Запрос.Выполнить().Пустой() Тогда
			ТекстСообщения = НСтр("ru = 'Элемент """ + ЭлементОбъекта + """ не принадлежит объетку аренды """ + ОбъектАренды + """. Проведение не возможно'");
			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения(, "Корректность",
			НСтр("ru = 'Элемент объекта'"),,, ТекстСообщения);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,
			"ЭлементОбъекта", "Объект", Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	Ответственный = Пользователи.ТекущийПользователь();

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Исключаем из проверки реквизиты, заполнение которых стало необязательным:
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	ПроверитьПринадлежностьЭлементаОбъекту(Отказ);
	
	// Удаляем из проверяемых реквизитов все, по которым автоматическая проверка не нужна:
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА

	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;

	ПараметрыПроведения = Документы.АР_ЗаявкаНаОбслуживание.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ИНФОРМАЦИОННОЙ БАЗЫ

	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ
	
	АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(ПараметрыПроведения.Работы, Движения, "АР_ЗаявкиНаОбслуживание", Отказ);
	АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(ПараметрыПроведения.Материалы, Движения, "АР_ЗаявкиНаОбслуживание", Отказ);
			
	ПроведениеСервер.УстановитьЗаписьОчищаемыхНаборовЗаписей(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();

КонецПроцедуры

#КонецЕсли
